var filteredData2 = [
   {
    "तालुका रत्नागिरी": "मंडणगड",
    "संस्था प्रकार कार्यालयाप्रमाणे": "शेती पतपुरवठा",
    "संस्था प्रकार डी ओ प्रमाणे": "विविध कार्यकारी संस्था",
    "संस्थेचे नांव": "पालवणी शेडवई विविध कार्यकारी सेवा सहकारी संस्था मर्या,  पालवणी",
    "संस्थेचे कार्यक्षेत्र": "जिल्हा",
    "लेखापरिक्षकाचे नाव": "परेश गजानन कर्णेकर",
    "लेखापरिक्षक प्रकार": "शासकिय",
    "पॅनल नंबर": " ERROR",
    "ठराव __ परंतुका": "परंतुका",
    "लेखापरीक्षण पुर्ण दिनांक": "",
    "लेखापरीक्षण अहवाल प्राप्त दिनांक": "",
    "लेखा परीक्षण शुल्क आकारणी रु ": "",
    "लेखा परीक्षण शुल्क वसुली रु ": "",
    "लेखा परीक्षण शुल्क वसुली दिनांक": "",
    "दोष दुरुस्ती अहवाल येणे दिनांक": "",
    "दोष दुरुस्ती अहवाल प्राप्त दिनांक दिनांक": "",
    "सन 2017_18  दुरुस्ती अहवास  येणे दिनांक": "",
    "सन 2017_18 दोष दुरुस्ती अहवाल प्राप्त दिनांक": ""
  }
]


const updateSocRdx = (state = filteredData2, action) => {
    switch (action.type) {
      case "update_soc":
        state = [];  
        var ob2 = Object.keys(action.cred).forEach(element => {          
        var ob1 = action.data.filter(obj=>  {
          return obj[element] == action.cred[element];
        })
        });
          console.log(ob2);
          return state ;
  
      default:
        return state;
    }
  };
  
  export default updateSocRdx;
  